Tekla Open API Reference for Tekla Structures 2025
Operation.CreateBentPlateByParts Method (Part, Part, Double)
 Modifies the first plate by adding a bend that connects it to the second plate creating a new BentPlate instance based on two parts and a radius. This method can change GUID when using from plug-ins. To keep GUID, use AddLeg(ConnectiveGeometry, ConnectiveGeometry, Double).
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BentPlate CreateBentPlateByParts(
	Part part1,
	Part part2,
	double radius
)
Public Shared Function CreateBentPlateByParts (
	part1 As Part,
	part2 As Part,
	radius As Double
) As BentPlate
Parameters
part1
Type: Tekla.Structures.Model.Part
One part used for creating the bent plate.
part2
Type: Tekla.Structures.Model.Part
The other part used for creating the bent plate.
radius
Type: System.Double
The target radius for the created cylindrical section.
Return Value
Type: BentPlate
The bent plate object if successful, null otherwise
Exceptions
Exception | Condition
ConnectiveGeometryException | Thrown if could not create ConnectiveGeometry instance.
ArgumentException | Thrown if received unsupported bent plate creation input.
See Also
Reference
Operation Class
CreateBentPlateByParts Overload
Tekla.Structures.Model.Operations Namespace